<?php

namespace Database\Seeders\Product;

use App\Models\Gallery\Gallery;
use App\Models\Product\Category;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $id=DB::table('products')->insertGetId([
            'deleted_at'=>now(),
            'name'=>'box atash neshani',
            'title'=>'باکس آتش نشانی',
            'short_description'=>'باکس آتش نشانی، وسیله ایمنی حیاتی برای ذخیره تجهیزات آتش نشانی است. این باکس‌ها می‌توانند به صورت نصب دیواری، زمینی، آویزان یا قابل حمل در مکان‌های مختلف استفاده شوند. آنها در ساختمان‌ها و مکان‌های استراتژیک نصب می‌شوند تا ایمنی و آمادگی در برابر حوادث حریق را تضمین کنند.',
            'long_description'=>'<p style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی</strong> یکی از اجزای حیاتی در سامانه‌های ایمنی و آتش نشانی ساختمان‌ها است. این باکس‌ها به منظور قراردادن و نگهداری تجهیزات و وسایل مرتبط با آتش نشانی مورد استفاده قرار می‌گیرند.</p>

<h2>محل قرارگیری باکس تش نشانی</h2>
<p style="font-size: 16px; text-align: justify;">یکی از ویژگی‌های مهم <strong>باکس آتش نشانی</strong>، موقعیت واقعی آن در ساختمان است. <strong>باکس آتش نشانی</strong> معمولاً در مکان‌های استراتژیکی مانند طبقات مختلف ساختمان، نزدیک به خروجی‌ها یا نقاط قابل دسترسی قرار می‌گیرد. این امر باعث سهولت استفاده و دسترسی سریع به تجهیزات آتش نشانی در صورت وقوع حادثه می‌شود.</p>
<p style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی</strong> عموماً شامل تجهیزات و وسایل ضروری برای مقابله با حریق می‌شود. این تجهیزات می‌توانند شامل انواع اتش‌نشانی، اعلام حریق، پرژکتورهای روشنایی، دستکش‌ها، ماسک‌های حریق، پنچرهای آتش نشانی و سایر وسایل مرتبط با ایمنی و اطفاء حریق باشند. این تجهیزات در <strong>باکس آتش نشانی</strong> به طور منظم بررسی و نگهداری می‌شوند تا در صورت لزوم، به درستی عمل کنند.</p>

<h2 style="text-align: justify;">انواع باکس آتش نشانی</h2>
<ol>
 	<li style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی دیواری:</strong> این نوع باکس آتش نشانی به دیوار یا سطح دیوار نصب می‌شود و می‌توان در طول مسیرهای اضطراری یا نزدیک به خروجی‌ها قرار داد. طراحی آن به گونه‌ای است که تجهیزات آتش نشانی مورد نیاز را به خوبی نگهداری کند و در صورت لزوم به سرعت قابل دسترسی باشد.</li>
 	<li style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی زمینی:</strong> این نوع باکس آتش نشانی به صورت زمینی قرار می‌گیرد و معمولاً در فضاهای باز، پارکینگ‌ها، باغ‌ها و محل‌های عمومی دیگر قرار می‌گیرد. طراحی آن به گونه‌ای است که تجهیزات آتش نشانی در برابر شرایط محیطی و آب و هوا محافظت شده و قابل دسترسی آسان باشد.</li>
 	<li style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی آویزان:</strong> این نوع باکس آتش نشانی به دیوار یا سقف نصب می‌شود و معمولاً در مکان‌هایی که فضای کمتری برای نصب باکس آتش نشانی وجود دارد، استفاده می‌شود. طراحی آن به گونه‌ای است که تجهیزات آتش نشانی را به طور ایمن نگهداری کند و در هنگام نیاز به سرعت قابل دسترسی باشد.</li>
 	<li style="font-size: 16px; text-align: justify;"><strong>باکس آتش نشانی قابل حمل:</strong> این نوع باکس آتش نشانی به صورت قابل حمل طراحی شده است و معمولاً در مکان‌هایی که به‌راحتی نمی‌توان باکس ثابت نصب کرد، استفاده می‌شود. این باکس‌ها دارای دستگیره‌ها و دسته‌هایی هستند که امکان حمل و نقل آسان را فراهم می‌کنند و در هنگام اضطرار به راحتی قابل استفاده هستند.</li>
</ol>
<p style="font-size: 16px; text-align: justify;">این نوع باکس اهمیت بسیاری در حفظ ایمنی ساختمان‌ها دارد. این باکس‌ها به عنوان نقطه مرجع و دسترسی سریع به تجهیزات آتش نشانی، در صورت وقوع حادثه، به افراد اجازه می‌دهند تا به سرعت اقدامات لازم را برای اطفاء حریق و اجلال افراد راه‌اندازی کنند. همچنین، وجود <strong>باکس آتش نشانی</strong> به منظور رعایت قوانین و مقررات مربوط به ایمنی ساختمان‌ها، ضروری است و می‌تواند در حمایت از ساکنان و کاربران ساختمان نقش مهمی ایفا کند.</p>
<p style="font-size: 16px; text-align: justify;">در نتیجه، این محصول یکی از عوامل اصلی در حفظ ایمنی ساختمان‌ها است. این باکس‌ها با نگهداری تجهیزات آتش نشانی و قرار دادن آنها در مکان‌های قابل دسترسی، به ساکنان و کاربران ساختمان امکان می‌دهند تا در صورت وقوع حادثه، سریعاً واکنش نشان دهند و از خطرات حریق جان سالم به در ببرند.</p>',
        'category_id'=>Category::whereName('Darb Hariq')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('firebox')->first()->id
        ]);


        $id=DB::table('products')->insertGetId([
            'name'=>'HDF door',
            'title'=>'درب HDF',
            'short_description'=>'درب داخلی یک قطعه مهم از ساختمان است که باعث جداسازی فضای داخلی از بیرون می‌شود. این درب همچنین می‌تواند به عنوان یک ابزار امنیتی باشد، و طراحی آن باید با توجه به نیازهای امنیتی باشد. در انتخاب درب داخلی باید به عواملی مانند جنس، ضخامت، روکش، نوع قفل و... توجه کرد. همچنین طراحی و رنگ درب می‌تواند با تزئینات داخلی و نوع دکوراسیون فضای داخلی سازگار باشد.',
            'long_description'=>'<h2 style="text-align: justify;">درب کلیک چیست؟</h2>
<p style="font-size: 16px; text-align: justify;"><span style="color: #800080;"><strong> درب کلیک</strong></span>، یک درب قابی است که از جنس پی وی سی و ام دی اف به قطر 5 و عرض 10 سانتیمتر ساخته می‌شود. این درب با دوشاخه تولید می‌شود که قامت درب را تشکیل می‌دهد، و یک شاخه هم پایین درب داخل خالی می‌باشد که شاخه‌ها را به صورت کشویی از بالا وارد قاب شکل‌گرفته می‌شود و شروع به چیده شدن روی هم و شکل‌گرفتن درب می‌کند.</p>
<p style="text-align: justify;">یکی از مزیت‌های این نوع درب، زیبایی و شکل‌پذیری بالاست. می‌توان برای زیبایی بیشتر، وسط درب بجای شاخه‌ی چوبی یک یا چند ریدف شیشه نیز به صورت کشویی وارد کرد. زمانی که شاخه‌ها کامل وارد درب شدن، قاب بالایی درب را جاگزاری می‌کند و درب کامل می‌شود.</p>
<p style="font-size: 16px; text-align: justify;"><strong><span style="color: #800080;">درب کلیک</span></strong> در مقایسه با درب‌های دیگر از لحاظ ظاهری، شکیل‌تر است و به درب‌های تمام چوب نزدیک‌تر می‌باشد. از لحاظ مقاومت نیز، به دلیل عدم خلل و فرج، از پی وی سی مقاومتر است. وزنی هم از وزن درب‌های ام دی اف و اچ دی اف می‌باشد.</p>
<p style="font-size: 16px; text-align: justify;">علاوه بر این مزایا، <strong><span style="color: #800080;">درب کلیک</span></strong> دارای مزیت‌های دیگری نیز است که ذکر می‌شود. به‌طور مثال، <strong><span style="color: #800080;">درب کلیک</span></strong> بسیار سبک است که این به معنای این است که نصب و جابجایی آن به راحتی انجام می‌شود. این درب، به دلیل کیفیت بالای ساختاری و قطعات مورد استفاده، بسیار پایدار و دارای عمر بالایی می باشد.</p>
<p style="font-size: 16px; text-align: justify;">این درب‌ها به دلیل خلل و فرج نداشتن، از پی وی سی تولید می‌شوند که موجب مقاومت بیشتر آن‌ها در برابر ضربه و سایر خطرات جسمی می‌شود. همچنین، درب‌های کلیک به لحاظ وزن نیز بسیار سبک وزن هستند و با توجه به کیفیت ساخت بالا، همیشه یکی از انتخاب‌های مناسب برای درب منازل، ادارات و محل‌های تجاری می‌باشند.</p>
<p style="font-size: 16px; text-align: justify;">به‌طورکلی، <strong><span style="color: #800080;">درب کلیک</span></strong> به دلیل طراحی خاص، مقاومت بیشتری نسبت به درب‌های سنتی دارند و از ضربه، رطوبت، نور خوردگی و تغییر دما به خوبی مقاومت می‌کنند. همچنین، این درب‌ها به دلیل ظاهری شیک و جذاب، انتخاب مناسبی برای زیبایی و ایمنی درب ورودی محل‌های مختلف هستند.</p>

<h2 style="text-align: justify;">مزایای درب کلیک</h2>
<p style="font-size: 16px; text-align: justify;">همانطور که گفته شد این درب‌ها با توجه به جنس آن‌ها مقاومت بالایی دارند و در مقابل شرایط نامساعد هوا و رطوبت مانند <a href="https://aryadoorsam.com/%D9%85%D8%AD%D8%B5%D9%88%D9%84%D8%A7%D8%AA/"><strong><span style="color: #800080;">درب‌های چوبی و MDF</span></strong></a> مقاومت بیشتری دارند. همچنین، برای تزئین بیشتر و جلوگیری از حفره‌های موجود در سطح درب، می‌توان از ردیف شیشه‌ای استفاده کرد. <strong><span style="color: #800080;">درب کلیک</span></strong>، نسبت به درب‌های سنتی، در ظاهر بهتری برخوردار هستند و در عین حال هم وزنی مشابه <a href="https://aryadoorsam.com/%D9%85%D8%AD%D8%B5%D9%88%D9%84%D8%A7%D8%AA/"><strong><span style="color: #800080;">درب‌های MDF و HDF دارند</span></strong></a>.</p>
<p style="font-size: 16px; text-align: justify;">با توجه به همه این ویژگی‌ها، <strong><span style="color: #800080;">درب کلیک</span> </strong>به عنوان یک جایگزین مناسب و هوشمندانه برای درب‌های سنتی شناخته شده‌اند. همچنین، این درب‌ها در طراحی داخلی منازل و ساختمان‌ها به دلیل ظاهر زیبا و کاربری آسان به کار گرفته می‌شوند. با توجه به اینکه <strong><span style="color: #800080;">درب کلیک</span></strong> از جنس پی وی سی و ام دی اف تولید می‌شود، همراه با بالا بردن زیبایی و کاربری محصول، به حفظ محیط زیست و کاهش تخریب جنگل‌ها نیز کمک می‌کند.</p>',
            'category_id'=>Category::whereName('Darb Dakheli')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-grey-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-white-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-black-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-brown-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-grey-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-white-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-black-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-brown-left')->first()->id
        ]);

/////////////////////
///
        $id=DB::table('products')->insertGetId([
            'name'=>'MDF door',
            'title'=>'درب MDF',
            'short_description'=>'درب داخلی یک قطعه مهم از ساختمان است که باعث جداسازی فضای داخلی از بیرون می‌شود. این درب همچنین می‌تواند به عنوان یک ابزار امنیتی باشد، و طراحی آن باید با توجه به نیازهای امنیتی باشد. در انتخاب درب داخلی باید به عواملی مانند جنس، ضخامت، روکش، نوع قفل و... توجه کرد. همچنین طراحی و رنگ درب می‌تواند با تزئینات داخلی و نوع دکوراسیون فضای داخلی سازگار باشد.',
            'long_description'=>'<h2 style="text-align: justify;">درب کلیک چیست؟</h2>
<p style="font-size: 16px; text-align: justify;"><span style="color: #800080;"><strong> درب کلیک</strong></span>، یک درب قابی است که از جنس پی وی سی و ام دی اف به قطر 5 و عرض 10 سانتیمتر ساخته می‌شود. این درب با دوشاخه تولید می‌شود که قامت درب را تشکیل می‌دهد، و یک شاخه هم پایین درب داخل خالی می‌باشد که شاخه‌ها را به صورت کشویی از بالا وارد قاب شکل‌گرفته می‌شود و شروع به چیده شدن روی هم و شکل‌گرفتن درب می‌کند.</p>
<p style="text-align: justify;">یکی از مزیت‌های این نوع درب، زیبایی و شکل‌پذیری بالاست. می‌توان برای زیبایی بیشتر، وسط درب بجای شاخه‌ی چوبی یک یا چند ریدف شیشه نیز به صورت کشویی وارد کرد. زمانی که شاخه‌ها کامل وارد درب شدن، قاب بالایی درب را جاگزاری می‌کند و درب کامل می‌شود.</p>
<p style="font-size: 16px; text-align: justify;"><strong><span style="color: #800080;">درب کلیک</span></strong> در مقایسه با درب‌های دیگر از لحاظ ظاهری، شکیل‌تر است و به درب‌های تمام چوب نزدیک‌تر می‌باشد. از لحاظ مقاومت نیز، به دلیل عدم خلل و فرج، از پی وی سی مقاومتر است. وزنی هم از وزن درب‌های ام دی اف و اچ دی اف می‌باشد.</p>
<p style="font-size: 16px; text-align: justify;">علاوه بر این مزایا، <strong><span style="color: #800080;">درب کلیک</span></strong> دارای مزیت‌های دیگری نیز است که ذکر می‌شود. به‌طور مثال، <strong><span style="color: #800080;">درب کلیک</span></strong> بسیار سبک است که این به معنای این است که نصب و جابجایی آن به راحتی انجام می‌شود. این درب، به دلیل کیفیت بالای ساختاری و قطعات مورد استفاده، بسیار پایدار و دارای عمر بالایی می باشد.</p>
<p style="font-size: 16px; text-align: justify;">این درب‌ها به دلیل خلل و فرج نداشتن، از پی وی سی تولید می‌شوند که موجب مقاومت بیشتر آن‌ها در برابر ضربه و سایر خطرات جسمی می‌شود. همچنین، درب‌های کلیک به لحاظ وزن نیز بسیار سبک وزن هستند و با توجه به کیفیت ساخت بالا، همیشه یکی از انتخاب‌های مناسب برای درب منازل، ادارات و محل‌های تجاری می‌باشند.</p>
<p style="font-size: 16px; text-align: justify;">به‌طورکلی، <strong><span style="color: #800080;">درب کلیک</span></strong> به دلیل طراحی خاص، مقاومت بیشتری نسبت به درب‌های سنتی دارند و از ضربه، رطوبت، نور خوردگی و تغییر دما به خوبی مقاومت می‌کنند. همچنین، این درب‌ها به دلیل ظاهری شیک و جذاب، انتخاب مناسبی برای زیبایی و ایمنی درب ورودی محل‌های مختلف هستند.</p>

<h2 style="text-align: justify;">مزایای درب کلیک</h2>
<p style="font-size: 16px; text-align: justify;">همانطور که گفته شد این درب‌ها با توجه به جنس آن‌ها مقاومت بالایی دارند و در مقابل شرایط نامساعد هوا و رطوبت مانند <a href="https://aryadoorsam.com/%D9%85%D8%AD%D8%B5%D9%88%D9%84%D8%A7%D8%AA/"><strong><span style="color: #800080;">درب‌های چوبی و MDF</span></strong></a> مقاومت بیشتری دارند. همچنین، برای تزئین بیشتر و جلوگیری از حفره‌های موجود در سطح درب، می‌توان از ردیف شیشه‌ای استفاده کرد. <strong><span style="color: #800080;">درب کلیک</span></strong>، نسبت به درب‌های سنتی، در ظاهر بهتری برخوردار هستند و در عین حال هم وزنی مشابه <a href="https://aryadoorsam.com/%D9%85%D8%AD%D8%B5%D9%88%D9%84%D8%A7%D8%AA/"><strong><span style="color: #800080;">درب‌های MDF و HDF دارند</span></strong></a>.</p>
<p style="font-size: 16px; text-align: justify;">با توجه به همه این ویژگی‌ها، <strong><span style="color: #800080;">درب کلیک</span> </strong>به عنوان یک جایگزین مناسب و هوشمندانه برای درب‌های سنتی شناخته شده‌اند. همچنین، این درب‌ها در طراحی داخلی منازل و ساختمان‌ها به دلیل ظاهر زیبا و کاربری آسان به کار گرفته می‌شوند. با توجه به اینکه <strong><span style="color: #800080;">درب کلیک</span></strong> از جنس پی وی سی و ام دی اف تولید می‌شود، همراه با بالا بردن زیبایی و کاربری محصول، به حفظ محیط زیست و کاهش تخریب جنگل‌ها نیز کمک می‌کند.</p>',
            'category_id'=>Category::whereName('Darb Dakheli')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-grey-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-white-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-black-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-brown-right')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-grey-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-white-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-black-left')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('click-door-brown-left')->first()->id
        ]);

        $id=DB::table('products')->insertGetId([
            'deleted_at'=>now(),
            'name'=>'serqat luxury door',
            'title'=>'درب ضدسرقت مدرن',
            'short_description'=>'<p style="text-align: justify;">درب ضدسرقت مدرن، امنیت و زیبایی ساختمان را تضمین می‌کند. طراحی مدرن، مواد مقاوم و فناوری پیشرفته، امکانات امنیتی پیشرفته. نصب و نگهداری دقیق و توجه به استانداردها. انتخاب از تولیدکنندگان معتبر و مشاوره تخصصی. بهبود امنیت، استحکام و زیبایی ساختمان.</p>',
            'long_description'=>'<p style="font-size: 16px; text-align: justify;"><strong>درب ضدسرقت مدرن، نسل جدیدی از درب‌های امنیتی است که با ترکیبی از طراحی مدرن و فناوری پیشرفته، برای مقابله با روش‌های تخریب و نفوذ ناخواسته طراحی شده است.</strong></p>

<h2>درب ضدسرقت مدرن چه ویژگی هایی دارد؟</h2>
<p style="font-size: 16px; text-align: justify;">این درب‌ها با استفاده از مواد مقاوم مانند فولاد، آلومینیوم یا چوب تقویت شده ساخته می‌شوند و دارای ساختاری مستحکم و مقاوم در برابر ضربه و برش هستند.طراحی آیینه، رنگ‌آمیزی زیبا و سیستم‌های قفل‌گذاری پیچیده، درب ضدسرقت مدرن را به یک اثر هنری نیز تبدیل کرده است. طرح‌ها و رنگ‌های متنوعی که بر روی این درب‌ها قرار می‌گیرند، به ساختمان‌ها جلوه زیبایی می‌بخشند و باعث می‌شوند امنیت و زیبایی در کنار یکدیگر وجود داشته باشند.</p>
<p style="font-size: 16px; text-align: justify;">علاوه بر این، <strong>درب ضدسرقت مدرن</strong> مجهز به سیستم‌های امنیتی پیشرفته است. قفل‌های الکترونیکی، تکنولوژی بیومتریک و سیستم‌های کنترل دسترسی، به کاربران امکان می‌دهند تا به صورت سریع و مطمئن وارد و خارج شوند و در عین حال جلوگیری از دسترسی غیرمجاز و کنترل دسترسی به ساختمان را بهبود می‌بخشند. سیستم‌های اعلام حریق و امنیتی دیگر نیز معمولاً به <strong>درب ضدسرقت مدرن</strong> اضافه می‌شوند، که در صورت بروز وقوع حریق یا خطرات دیگر، اطلاع رسانی می‌کنند و اقدامات لازم را به موقع انجام می‌دهند.</p>

<h3>مزایای درب ضدسرقت مدرن</h3>
<p style="font-size: 16px; text-align: justify;">مزیت دیگر <strong>درب ضدسرقت مدرن</strong>، عملکرد صامت و صدای کم آن است. با استفاده از مکانیزم‌های حرکتی مدرن و سیستم‌های صوتی ویدئویی، می‌توان به راحتی درب را باز و بسته کرد و از تزاحم صدا جلوگیری کرد. این امر به ویژه در محیط‌های مسکونی و تجاری حیاتی است تا از اختلال در فعالیت‌ها و خلأ در حریم خصوصی جلوگیری شود.</p>

<h3>نصب درب ضدسرقت مدرن</h3>
<p style="font-size: 16px; text-align: justify;">نکته مهمی که در نصب <strong>درب ضدسرقت مدرن</strong> باید رعایت شود، استفاده از متخصصین ماهر و مجرب در این زمینه است. نصب صحیح و دقیق این درب‌ها به کمک تجهیزات و ابزارهای مناسب ضروری است تا امکان بهره‌برداری کامل و صحیح از این سیستم امنیتی فراهم شود.</p>
نتیجه گیری:
<p style="font-size: 16px; text-align: justify;"><strong>درب ضدسرقت</strong> <strong>مدرن</strong> تنها به عنوان یک سیستم امنیتی نباشد، بلکه به عنوان یک المان زیبایی و دکوراسیون نیز مد نظر باشد. با استفاده از طراحی‌های مدرن و متنوع، می‌توان این درب‌ها را به یک عنصر جذاب و تزئینی در ساختمان تبدیل کرد و هماهنگی با دیگر المان‌های دکوراسیون داخلی را برقرار کرد.</p>
<p style="font-size: 16px; text-align: justify;">به طور خلاصه، <strong>درب ضدسرقت مدرن</strong> یک جزء بسیار مهم و ضروری در حفظ امنیت و زیبایی ساختمان‌ها است. طراحی مدرن، استفاده از مواد مقاوم و فناوری‌های پیشرفته، هماهنگی با دیگر المان‌های دکوراسیون داخلی و امکانات امنیتی پیشرفته، این درب را به یک گزینه برتر برای حفظ امنیت و افزایش زیبایی ساختمان تبدیل کرده است.</p>
<p style="font-size: 16px; text-align: justify;">در نصب و نگهداری این درب‌ها باید دقت ویژه‌ای صورت گیرد. انتخاب متخصصین مجرب در نصب، تنظیم و بررسی سیستم‌های مرتبط با <strong>درب ضدسرقت مدرن</strong> بسیار حائز اهمیت است. همچنین، آموزش به کاربران ساختمان درباره استفاده صحیح از درب و اطلاع از ویژگی‌های امنیتی آن نیز باید مورد توجه قرار گیرد.</p>
<p style="font-size: 16px; text-align: justify;">در آخر، انتخاب <strong>درب ضدسرقت مدرن</strong> بر اساس نیازها و استانداردهای معتبر بسیار مهم است. در هنگام خرید درب، بهتر است از تولیدکنندگان معتبر و محصولاتی که با استانداردهای مربوطه سازگاری دارند، استفاده کنید. همچنین، توصیه می‌شود قبل از خرید، نمونه‌های مختلف را بررسی کرده و با مشاوران تخصصی <strong>درب ضدسرقت مدرن</strong> مشورت کنید تا درب مناسبی که هماهنگ با نیازها و سلیقه شماست، انتخاب کنید.</p>
<p style="font-size: 16px; text-align: justify;">در نهایت، با انتخاب و نصب یک <strong>درب ضدسرقت مدرن</strong> مطمئن می‌توانید امنیت خانه یا محل کار خود را افزایش داده و همچنین به زیبایی و استحکام ساختمان بیفزایید.</p>',
            'category_id'=>Category::whereName('Darb Serqat')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('serqat-luxury-door')->first()->id
        ]);

        $id=DB::table('products')->insertGetId([
            'deleted_at'=>now(),
            'name'=>'bad-bezani-door',
            'title'=>'درب بادبزنی',
            'short_description'=>'<p style="text-align: justify;">درب‌های بادبزنی بیمارستانی با تردد سریع و آسان، استانداردهای بهداشتی و ایمنی، عایق صوتی و حرارتی، سنسورهای حرکتی و طراحی زیبا، مقاومت فیزیکی و ضدعفونی و ضدآتش، اهمیت بسیار زیادی در بیمارستانها دارند.</p>',
            'long_description'=>'<p style="font-size:16px;text-align: justify;"><strong>درب‌های بادبزنی بیمارستانی، یکی از اجزای حیاتی در طراحی و عملکرد بهینه بیمارستان‌ها محسوب می‌شوند.</strong></p>
<p style="font-size:16px;text-align: justify;">این درب ها علاوه بر ایجاد یک تردد سریع و آسان برای بیماران و کادر درمانی، بایستی مطابق با استانداردهای بهداشتی و ایمنی از جمله درب‌های ضدعفونی و ضدآتش باشند.</p>
<p style="font-size:16px;text-align: justify;">یکی از ویژگی‌های مهم <strong>درب‌ بادبزنی بیمارستانی</strong>، قابلیت باز و بسته شدن سریع است. این درها با دارا بودن مکانیزم‌های خاص، به سادگی می‌توانند در کمترین زمان ممکن باز و بسته شوند. این امر در شرایط اضطراری و نیاز به انتقال سریع بیماران، بسیار اهمیت دارد.</p>
<p style="font-size:16px;text-align: justify;">همچنین، <strong>درب‌ بادبزنی بیمارستانی</strong> باید به خوبی عایق صوتی و حرارتی باشند. این امکان باعث کاهش نفوذ صدا و حفظ دمای مناسب در اتاق‌های بیمارستان می‌شود. این ویژگی‌ها به بهبود شرایط راحتی و آرامش بیماران و کادر درمانی کمک می‌کند.</p>
<p style="font-size:16px;text-align: justify;">علاوه بر این، <strong>درب‌ بادبزنی بیمارستانی</strong> باید به راحتی توسط افراد با هر سطح توانایی قابل استفاده باشند. برای این منظور، این درب‌ها معمولاً با سنسورهای حرکتی و کنترل‌های خودکار مجهز شده‌اند که با شناسایی حرکت فرد، به طور خودکار باز و بسته می‌شوند.</p>
<p style="font-size:16px;text-align: justify;"><strong>درب بادبزنی بیمارستانی</strong> نیز باید به عنوان یک عنصر زیبایی‌شناسانه در طراحی بیمارستان مدنظر قرار گیرند. طراحی مناسب، جنس باکیفیت و قابلیت مقاومت در برابر آتش و غیره...</p>
<p style="font-size:16px;text-align: justify;"><strong>درب‌ بادبزنی بیمارستانی</strong> با توجه به نیازهای مختلف، به شکل‌ها و طرح‌های متنوعی در دسترس هستند. امروزه، درب‌های بادبزنی با طراحی مدرن و جذابی که با قالب‌های شیشه‌ای و فلزی ترکیب می‌شوند، مورد توجه قرار می‌گیرند. این درب‌ها به عنوان یک عنصر تزیینی در طراحی داخلی بیمارستان اهمیت دارند و باعث افزایش زیبایی و جذابیت فضا می‌شوند.</p>
<p style="font-size:16px;text-align: justify;">ضمناً، برخی <strong>درب‌های بادبزنی بیمارستانی</strong> مجهز به صفحات شیشه‌ای تراپانسنت هستند که امکان دیدن و ارتباط بیماران و همچنین کادر درمانی را تسهیل می‌کنند. این ویژگی بهبود ارتباط و ایجاد احساس امنیت برای بیماران در طول درمان را تقویت می‌کند.</p>
<p style="font-size:16px;text-align: justify;">علاوه بر ظاهر زیبا، <strong>درب‌های بادبزنی بیمارستانی</strong> باید از جنسهای مقاومی ساخته شوند تا در مقابل ضربه‌ها و سایر خطرات فیزیکی مقاومت کنند. همچنین، قابلیت ضدعفونی و ضدآتش نیز برای این درب‌ها حائز اهمیت است. استفاده از مواد باکیفیت و رعایت استانداردهای ایمنی مربوطه، از اهمیت بالایی برخوردار است.</p>
<p style="text-align: justify;">با توجه به نقش مهمی که درب‌های بادبزنی بیمارستانی در حفظ امنیت و سلامت بیماران دارند، انتخاب و نصب یک درب ضدسرقت و با استانداردهای لازم، امری بسیار حیاتی است. مشاوره با تولیدکنندگان معتبر و کسب اطلاعات کامل در مورد ویژگی‌ها و قابلیت‌ این نوع درب ها بسیار حائز اهمیت است.</p>',
            'category_id'=>Category::whereName('Darb Serqat')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('bad-bezani-door')->first()->id
        ]);

        $id=DB::table('products')->insertGetId([
            'name'=>'single fire door',
            'title'=>'درب تک لنگه ضد حریق',
            'short_description'=>'',
            'long_description'=>'',
            'category_id'=>Category::whereName('Darb Hariq')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('bad-bezani-door')->first()->id
        ]);

        $id=DB::table('products')->insertGetId([
            'name'=>'double fire door',
            'title'=>'درب دو لنگه ضد حریق',
            'short_description'=>'',
            'long_description'=>'',
            'category_id'=>Category::whereName('Darb Hariq')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('bad-bezani-door')->first()->id
        ]);

        $id=DB::table('products')->insertGetId([
            'name'=>'data center door',
            'title'=>'درب دیتاسنتر',
            'short_description'=>'',
            'long_description'=>'',
            'category_id'=>Category::whereName('Darb Hariq')->first()->id
        ]);
        DB::table('gallery_product')->insert([
            'product_id'=>$id,
            'gallery_id'=>Gallery::whereName('bad-bezani-door')->first()->id
        ]);

    }
}
